# AceleraDev Codenation | Data Science - Semana 2

### Isabella Menezes Ramos

## Manipulando dados

In [1]:
#Importando os pacotes
import pandas as pd
import numpy as np

In [229]:
#acessando o help dos pacotes
pd?

### Dicionários

In [230]:
#Criando um dicionário com os dados
dados = {'canal_venda' : ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos': [100, 200, 300 ,400, 500],
        'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
        'vendas': [1000.52, 1052.34, 2002, 5000, 300 ]}

In [231]:
#para printar o dicionáario
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [232]:
#verificando o tipo do dicionario
type(dados)

dict

In [233]:
#Acessando as chaves do meu dicionario
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [234]:
#Acessando uma chave especifica
dados['site']

['site1', 'site1', 'site2', 'site2', 'site3']

In [235]:
#Acessando uma posicao especifica de um dicionario
dados['acessos'][1]

200

In [236]:
#Acessando uma posicao especifica de um dicionario
dados['canal_venda'][2]

'instagram'

In [237]:
#Acessando uma posicao especifica de um dicionario

#acessando os três primeiros
dados['canal_venda'][:3]

['facebook', 'twitter', 'instagram']

In [238]:
#acessando os três últimos
dados['canal_venda'][2:]

['instagram', 'linkedin', 'facebook']

### Listas

In [239]:
#verificar se é uma lista
type([1,2,3])

list

In [240]:
#Criando uma lista
lista = [200, 200 , 300 ,800, 200]

In [241]:
#printando a lista
lista

[200, 200, 300, 800, 200]

In [242]:
#Vendo valores especificos
lista[1]

200

In [243]:
#fatia da lista
lista[:3]

[200, 200, 300]

In [244]:
# Adicionando a lista ao dicionario 
dados['lista'] = lista

In [245]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

### DataFrames

In [246]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

In [247]:
#Criar um data frame a partir de um dict
dataframe = pd.DataFrame(dados)

In [248]:
#acessando o dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [249]:
#printando os primeiros casos do dataframe
dataframe.head(3)

#uma das primeiras coisas a se fazer num dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300

In [250]:
#Verificando o formato do dataframe
dataframe.shape

#primeira coisa a se fazer num dataframe

(5, 5)

In [251]:
QQRNOME = dataframe

In [252]:
QQRNOME.shape

(5, 5)

In [253]:
type(QQRNOME)

pandas.core.frame.DataFrame

In [254]:
#Verificando o indice do dataframe
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [255]:
#Verificando os tipos dos dados do dataframe
dataframe.dtypes

#também muito importante em análise exploratória de dados

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [256]:
#Contar a quatidade de tipos de dados do dataframe
dataframe.dtypes.value_counts()

object     2
int64      2
float64    1
dtype: int64

In [257]:
#Verificando se existem valores faltantes
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [258]:
#Contagem de valores faltantes
dataframe.isna().sum()

canal_venda    0
acessos        0
site           0
vendas         0
lista          0
dtype: int64

In [259]:
#printando os nomes das colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [260]:
#Acessando uma coluna especifica
dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [261]:
#transformar uma coluna em uma lista
list(dataframe['canal_venda'])

['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']

In [262]:
# Criando uma nova coluna
dataframe['nova_coluna'] = [1, 2, 3, 4, 5]

In [263]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [264]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [265]:
# Removendo colunas
dataframe.drop(columns = 'nova_coluna', inplace= True)

In [266]:
#Remover mais de uma coluna
dataframe.drop(columns= ['acessos','site','canal_venda'])

    vendas  lista
0  1000.52    200
1  1052.34    200
2  2002.00    300
3  5000.00    800
4   300.00    200

In [267]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [268]:
#Mostrando as colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [269]:
#Acessando valores especificos
dataframe['canal_venda'][1]

'twitter'

In [270]:
#Acessando fatia de coluna especifica
dataframe['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [271]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [272]:
### Fatiando os dados usando o iloc (linhas | colunas)
dataframe.iloc[:2,1:]

   acessos   site   vendas  lista
0      100  site1  1000.52    200
1      200  site1  1052.34    200

In [273]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [274]:
#Fatiar os dados usando o loc (indice)
dataframe.loc[:3]

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800

In [275]:
#Selecionando colunas especificas
dataframe[['canal_venda', 'vendas']]

  canal_venda   vendas
0    facebook  1000.52
1     twitter  1052.34
2   instagram  2002.00
3    linkedin  5000.00
4    facebook   300.00

In [276]:
#Passando os valores atraves de lista, para acessar apenas essas colunas no meu dataframe
filtro = ['canal_venda', 'acessos']

In [277]:
dataframe[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [278]:
# Usando o metodo info() falando sobre as colunas, valores nulos e o tipo de dados
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes

In [279]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [280]:
#Pivotando os dados (coluna)
dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')

site         site1  site2  site3
canal_venda
facebook     100.0    NaN  500.0
instagram      NaN  300.0    NaN
linkedin       NaN  400.0    NaN
twitter      200.0    NaN    NaN

In [281]:
aux = dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')

In [282]:
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   site1   2 non-null      float64
 1   site2   2 non-null      float64
 2   site3   1 non-null      float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [283]:
#Completando os valores faltantes usando fillna
#Pivotando os dados (coluna)
aux= dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)
dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [284]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [285]:
# Mudando as colunas usando o comando melt
dataframe.melt(id_vars='site', value_vars=['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda    twitter
2  site2  canal_venda  instagram
3  site2  canal_venda   linkedin
4  site3  canal_venda   facebook

In [286]:
#Resetando o indice do dataframe
print(aux.columns)
aux = dataframe.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['index', 'canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [287]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [288]:
aux.reset_index()

   level_0  index canal_venda  acessos   site   vendas  lista
0        0      0    facebook      100  site1  1000.52    200
1        1      1     twitter      200  site1  1052.34    200
2        2      2   instagram      300  site2  2002.00    300
3        3      3    linkedin      400  site2  5000.00    800
4        4      4    facebook      500  site3   300.00    200

In [289]:
aux

   index canal_venda  acessos   site   vendas  lista
0      0    facebook      100  site1  1000.52    200
1      1     twitter      200  site1  1052.34    200
2      2   instagram      300  site2  2002.00    300
3      3    linkedin      400  site2  5000.00    800
4      4    facebook      500  site3   300.00    200

In [290]:
#Somando as colunas do dataframe
dataframe.sum()

canal_venda    facebooktwitterinstagramlinkedinfacebook
acessos                                            1500
site                          site1site1site2site2site3
vendas                                          9354.86
lista                                              1700
dtype: object

In [291]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [326]:
#Somando as colunas do dataframe
dataframe.sum()

canal_venda                   facebooktwitterinstagramlinkedinfacebook
acessos                                                           1500
site                                         site1site1site2site2site3
vendas                                                         9354.86
lista                                                             1700
categoria_vendas        0 a 15000 a 15002000 a 80002000 a 80000 a 1500
categoria_acessos    menor_que_300menor_que_300menor_que_300maior_q...
dtype: object

In [325]:
#Somando as linhas do dataframe
dataframe.sum(axis = 1)

0    1300.52
1    1452.34
2    2602.00
3    6200.00
4    1000.00
dtype: float64

In [293]:
#Calculando a mediana das colunas numericas
print('Por linha: ',dataframe.median(axis= 1) )
print('Por coluna: ', dataframe.median())

Por linha:  0    200.0
1    200.0
2    300.0
3    800.0
4    300.0
dtype: float64
Por coluna:  acessos     300.00
vendas     1052.34
lista       200.00
dtype: float64

In [294]:
#Calculando a media das colunas númericas
dataframe.mean()

acessos     300.000
vendas     1870.972
lista       340.000
dtype: float64

In [295]:
#Calculando o desvio padrão das colunas numericas
dataframe.std()

acessos     158.113883
vendas     1850.931024
lista       260.768096
dtype: float64

In [296]:
#Usando o comando describe que calcula estatisticas descritivas para colunas numericas
dataframe.describe()

          acessos       vendas       lista
count    5.000000     5.000000    5.000000
mean   300.000000  1870.972000  340.000000
std    158.113883  1850.931024  260.768096
min    100.000000   300.000000  200.000000
25%    200.000000  1000.520000  200.000000
50%    300.000000  1052.340000  200.000000
75%    400.000000  2002.000000  300.000000
max    500.000000  5000.000000  800.000000

In [297]:
#Calculando a moda
dataframe.mode()

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1   300.00  200.0
1         NaN      200  site2  1000.52    NaN
2         NaN      300    NaN  1052.34    NaN
3         NaN      400    NaN  2002.00    NaN
4         NaN      500    NaN  5000.00    NaN

In [298]:
# Valor maximo por coluna
dataframe.max()

canal_venda    twitter
acessos            500
site             site3
vendas            5000
lista              800
dtype: object

In [299]:
#Valor minimo por coluna
dataframe.min()

canal_venda    facebook
acessos             100
site              site1
vendas              300
lista               200
dtype: object

In [300]:
#Printando o numero de unicos
dataframe.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
lista          3
dtype: int64

In [301]:
#Contando valores unicos de uma coluna
dataframe['canal_venda'].value_counts()

facebook     2
linkedin     1
twitter      1
instagram    1
Name: canal_venda, dtype: int64

In [302]:
#Valores unicos de uma coluna
dataframe['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [303]:
# Usando o groupby com valores numericos
dataframe.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [304]:
# Usando o groupby com valores numericos
dataframe.groupby('canal_venda')['acessos'].median()

canal_venda
facebook     300
instagram    300
linkedin     400
twitter      200
Name: acessos, dtype: int64

In [305]:
# Usando o groupby com categoricos
dataframe.groupby('site')['canal_venda'].unique()

site
site1      [facebook, twitter]
site2    [instagram, linkedin]
site3               [facebook]
Name: canal_venda, dtype: object

In [306]:
# Usando o groupby com categoricos
dataframe.groupby('site')['canal_venda'].first()

site
site1     facebook
site2    instagram
site3     facebook
Name: canal_venda, dtype: object

In [307]:
#Usando o groupby com a função agg
dataframe.groupby('canal_venda').agg({'site': 'unique',
                                     'acessos': 'sum'})

                       site  acessos
canal_venda
facebook     [site1, site3]      600
instagram           [site2]      300
linkedin            [site2]      400
twitter             [site1]      200

In [327]:
#Correlações entre variaveis
dataframe.corr(method = 'pearson')
#spearman

          acessos    vendas     lista
acessos  1.000000  0.217542  0.363803
vendas   0.217542  1.000000  0.979211
lista    0.363803  0.979211  1.000000

In [309]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [310]:
#Criando variaveis categoricas por fatia de variavel numerica
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                       bins= (0, 1500, 2000, 8000), 
                                       labels = ('0 a 1500', '1500 a 2000', '2000 a 8000'))

In [311]:
dataframe

  canal_venda  acessos   site   vendas  lista categoria_vendas
0    facebook      100  site1  1000.52    200         0 a 1500
1     twitter      200  site1  1052.34    200         0 a 1500
2   instagram      300  site2  2002.00    300      2000 a 8000
3    linkedin      400  site2  5000.00    800      2000 a 8000
4    facebook      500  site3   300.00    200         0 a 1500

In [312]:
#Criando variavel categorica usando compressao de lista
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [313]:
dataframe

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300

In [314]:
#Juntando dois dataframes | Criando o dataframe_2
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
               'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']})

In [315]:
#Realizando o merge
dataframe.merge(dataframe_2, on = 'site', how = 'left')
#left join é um join lateral

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
1,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
2,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
3,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
4,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
5,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
6,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
7,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
8,facebook,500,site3,300.00,200,0 a 1500,maior_que_300,Ezequiel

In [316]:
#Salvando o dataframe como csv
dataframe.to_csv('dataframe.csv', sep = ';', decimal = ',', index = False)

In [317]:
#Lendo dados no formato csv
dataframe_lido = pd.read_csv('dataframe.csv', sep = ';', decimal = ',')

In [318]:
dataframe_lido.head()

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300

In [319]:
json = pd.read_json('https://pricing.us-east-1.amazonaws.com/offers/v1.0/aws/index.json')

In [320]:
json['offers'][99]

{'offerCode': 'AmazonMQ',
 'versionIndexUrl': '/offers/v1.0/aws/AmazonMQ/index.json',
 'currentVersionUrl': '/offers/v1.0/aws/AmazonMQ/current/index.json',
 'currentRegionIndexUrl': '/offers/v1.0/aws/AmazonMQ/current/region_index.json'}

In [321]:
json.reset_index(inplace = True)

In [322]:
json['index']

0                    A4B
1             AWSAmplify
2             AWSAppSync
3              AWSBackup
4             AWSBudgets
             ...
143    comprehendmedical
144         datapipeline
145      mobileanalytics
146           transcribe
147            translate
Name: index, Length: 148, dtype: object

## Imputação de dados

In [2]:
df = pd.read_csv('train.csv')

In [3]:
aux = pd.DataFrame({'colunas': df.columns,
                    'tipos': df.dtypes,
                    'percentual_faltante': df.isna().sum() / df.shape[0]})

In [4]:
aux

                 colunas    tipos  percentual_faltante
PassengerId  PassengerId    int64             0.000000
Survived        Survived    int64             0.000000
Pclass            Pclass    int64             0.000000
Name                Name   object             0.000000
Sex                  Sex   object             0.000000
Age                  Age  float64             0.198653
SibSp              SibSp    int64             0.000000
Parch              Parch    int64             0.000000
Ticket            Ticket   object             0.000000
Fare                Fare  float64             0.000000
Cabin              Cabin   object             0.771044
Embarked        Embarked   object             0.002245

In [5]:
#Dados númericos : média ou mediana
df['Age'] = df['Age'].fillna(df['Age'].mode())

In [6]:
#Dados categoricos: Unknown ou moda
df['Cabin'] = df['Cabin'].fillna('Unknown')

In [7]:
df['Cabin'].value_counts()

Unknown        687
B96 B98          4
C23 C25 C27      4
G6               4
F2               3
              ...
D19              1
C148             1
D11              1
B42              1
B3               1
Name: Cabin, Length: 148, dtype: int64

In [8]:
df.shape[0]

891